{
  "header": {
    "about": "About",
    "menu": "Menu",
    "reset": "Reset",
    "rematch": "Rematch",
    "fullscreen": {
      "enter": "Enter Full Screen",
      "exit": "Exit Full Screen"
    },
    "volume": {
      "mute": "Mute Sound",
      "unmute": "Unmute Sound"
    },
    "install": {
      "button": "Install",
      "button_app": "Install App",
      "title": "Install App",
      "ios_title": "Tap the share icon and select 'Add to Home Screen'"
    },
    "playModes": {
      "classic": "Classic",
      "autoHide": "Auto Hide Mode"
    },
    "github": "Visit GitHub Repository"
  },
  "main_menu": {
    "game_modes": {
      "computer": "Play vs Computer",
      "local": "Play Locally",
      "online": "Play Online",
      "return_to_match": "Return to Match"
    },
    "difficulty": {
      "easy": "Easy",
      "medium": "Medium",
      "hard": "Hard"
    },
    "multiplayer": {
      "setup": {
        "title": "Multiplayer Setup",
        "subtitle": "Configure your game settings",
        "online_players": "Online Players",
        "find_match": "Find Match"
      },
      "board_size": "Board Size",
      "loading": {
        "finding_match": "Finding Match ...",
        "waiting": "Please wait while we connect you with another player"
      }
    }
  },
  "winner_popup": {
    "p1_wins": "Player 1 Wins!",
    "draws": "It's a Draw!",
    "p2_wins": "Player 2 Wins!"
  },
  "game_stats": {
    "p1_wins": "P1 Wins",
    "draws": "Draws",
    "p2_wins": "P2 Wins"
  },
  "power_ups": {
    "freeze": "Freeze",
    "bomb": "Bomb",
    "swap": "Swap"
  },
  "about": {
    "title": "About Tic Tac Toe",
    "close_aria": "Close About Popup",
    "game_objective": {
      "title": "Game Objective",
      "description": "Tic Tac Toe is a classic strategy game where two players take turns placing their symbols on a grid. The first player to get three (or more on larger boards) of their symbols in a row, either horizontally, vertically, or diagonally, wins!"
    },
    "how_to_play": {
      "title": "How to Play",
      "player1_starts": "Player 1 ({symbol}) always starts the game by placing their symbol first. Player 2 ({symbol2}) follows.",
      "click_to_place": "Simply click on any empty cell on the game board to place your symbol.",
      "get_in_row": "Get your symbols in a row (horizontal, vertical, or diagonal) to win.",
      "draw_if_full": "If all cells are filled with no winner, it's a draw."
    },
    "winning_example": {
      "title": "Winning Example",
      "description": "Here's a clear illustration of how Player 1 ({symbol}) can achieve victory with a diagonal connection on a standard 4x4 board:",
      "scenario": "In this scenario, Player 1 successfully connects Four {symbol} symbols along a diagonal path, securing the win."
    },
    "power_ups": {
      "title": "Power-Ups",
      "description": "Strategic advantages await! Each player has access to three unique power-ups that can dramatically alter the game's flow. Power-ups have a cooldown period after use, meaning they become available again only after a certain number of turns have passed. Using them at the right moment is key to mastering the game!",
      "freeze": {
        "title": "Freeze Power-Up",
        "description": "The Freeze power-up allows you to immobilize one of your opponent's active symbols on the board. Once a symbol is frozen, it becomes inactive, meaning:",
        "list_item_1": "It cannot be overwritten.",
        "list_item_2": "It does not contribute to any winning combinations.",
        "list_item_3": "It effectively acts as a block in your opponent's strategy.",
        "list_item_4": "It can still be exchanged using the Swap power-up.",
        "defensive_tool": "This power-up is a defensive tool used to disrupt potential winning lines. It can only target existing opponent symbols, not your own or empty cells. However, if a Bomb power-up hits a frozen cell, it will unfreeze it from the board without remove the symbol.",
        "example": "In this example, Player 1 ({symbol}) has used the Freeze power-up on Player 2's ({symbol2}) symbol in the top-middle cell. This {symbol2} is now frozen, making it unusable in future moves and blocking Player 2 from completing vertical, diagonal, or horizontal lines through that square."
      },
      "bomb": {
        "title": "Bomb Power-Up",
        "description": "The Bomb power-up grants you the ability to target any single square on the board. When activated, the selected square and all 8 surrounding adjacent squares (if they exist within the board's boundaries) will be instantly cleared of any symbols. If a targeted square happened to be frozen, the bomb will effectively remove the freeze effect but not the symbol.",
        "example_before": "Player 1 ({symbol}) is about to deploy the Bomb power-up, targeting the marked {symbol2} in the second row, second column. Notice the symbols surrounding it.",
        "example_after": "The {symbol2} and all its adjacent symbols have been successfully cleared, opening up new strategic possibilities for both players."
      },
      "swap": {
        "title": "Swap Power-Up",
        "description": "The Swap power-up allows you to exchange the positions of any two existing symbols on the board. This power-up is only active when two occupied squares are selected; it cannot be used if you choose an empty square. Utilize this power-up to instantly disrupt your opponent's almost-complete winning lines, or to immediately form your own winning combination!",
        "example_before": "Player 2 ({symbol2}) has strategically activated the Swap power-up. They selected their own {symbol2} in the bottom-right corner even though it's frozen and an opponent's {symbol} in the same row. These two symbols are about to swap places, allowing Player 2 to break the opponent's setup and possibly set up a winning line of their own. The Swap power-up can even exchange symbols that are frozen, making it a powerful tool to turn the tide of the game.",
        "example_after": "The {symbol} and {symbol2} have successfully swapped places. This strategic move allowed Player 2 ({symbol2}) to immediately complete a vertical winning line through the second column, securing their victory. By leveraging the Swap power-up even with a frozen symbol {symbol2} was able to turn a defensive position into a winning one."
      }
    }
  },
  "global": {
    "player": "player",
    "language": "Language",
    "left": "left",
    "languages": {
      "arabic": "Arabic",
      "english": "English",
      "french": "French",
      "hindi": "Hindi",
      "hungarian": "Hungarian",
      "japanese": "Japanese",
      "russian": "Russian"
    }
  },
  "modals": {
    "quit_game_modal": {
      "title": "Active Match",
      "message": "You are in an active match, would you like to quit?",
      "confirm": "Yes",
      "cancel": "No"
    }
  },
  "aria_labels": {
    "empty_square": "Empty square, click to make a move",
    "selected_square": "Selected square, click on opponent square to swap",
    "frozen_square": "Frozen square, cannot make a move",
    "occupied_square": "{symbol} symbol, occupied square"
  }
}