{
  "header": {
    "about": "के बारे में",
    "menu": "मेनू",
    "reset": "रीसेट",
    "rematch": "फिर से खेलें",
    "fullscreen": {
      "enter": "फुल स्क्रीन में प्रवेश करें",
      "exit": "फुल स्क्रीन से बाहर निकलें"
    },
    "volume": {
      "mute": "आवाज़ म्यूट करें",
      "unmute": "आवाज़ अनम्यूट करें"
    },
    "install": {
      "button": "इंस्टॉल करें",
      "button_app": "ऐप इंस्टॉल करें",
      "title": "ऐप इंस्टॉल करें",
      "ios_title": "शेयर आइकन पर टैप करें और 'होम स्क्रीन में जोड़ें' चुनें"
    },
    "playModes": {
      "classic": "क्लासिक",
      "autoHide": "ऑटो हाइड मोड"
    },
    "github": "GitHub रिपॉजिटरी पर जाएं"
  },
  "main_menu": {
    "game_modes": {
      "computer": "कंप्यूटर के खिलाफ खेलें",
      "local": "स्थानीय रूप से खेलें",
      "online": "ऑनलाइन खेलें",
      "return_to_match": "मैच पर वापस जाएं"
    },
    "difficulty": {
      "easy": "आसान",
      "medium": "मध्यम",
      "hard": "कठिन"
    },
    "multiplayer": {
      "setup": {
        "title": "मल्टीप्लेयर सेटअप",
        "subtitle": "अपने गेम सेटिंग्स कॉन्फ़िगर करें",
        "online_players": "ऑनलाइन खिलाड़ी",
        "find_match": "मैच खोजें"
      },
      "board_size": "बोर्ड का आकार",
      "loading": {
        "finding_match": "मैच खोजा जा रहा है ...",
        "waiting": "कृपया प्रतीक्षा करें जब हम आपको दूसरे खिलाड़ी से कनेक्ट करते हैं"
      }
    }
  },
  "winner_popup": {
    "p1_wins": "खिलाड़ी 1 जीतता है!",
    "draws": "यह ड्रॉ है!",
    "p2_wins": "खिलाड़ी 2 जीतता है!"
  },
  "game_stats": {
    "p1_wins": "खिलाड़ी 1 की जीत",
    "draws": "ड्रॉ",
    "p2_wins": "खिलाड़ी 2 की जीत"
  },
  "power_ups": {
    "freeze": "फ्रीज़",
    "bomb": "बम",
    "swap": "स्वैप"
  },
  "about": {
    "title": "टिक टैक टो के बारे में",
    "close_aria": "के बारे में पॉपअप बंद करें",
    "game_objective": {
      "title": "खेल का उद्देश्य",
      "description": "टिक टैक टो एक क्लासिक रणनीति खेल है जहां दो खिलाड़ी बारी-बारी से अपने प्रतीकों को ग्रिड पर रखते हैं। पहला खिलाड़ी जो तीन (या बड़े बोर्ड पर अधिक) अपने प्रतीकों को एक पंक्ति में, या तो क्षैतिज, ऊर्ध्वाधर, या तिरछे में लाता है, वह जीतता है!"
    },
    "how_to_play": {
      "title": "कैसे खेलें",
      "player1_starts": "खिलाड़ी 1 ({symbol}) हमेशा अपना प्रतीक पहले रखकर खेल शुरू करता है। खिलाड़ी 2 ({symbol2}) उसके बाद आता है।",
      "click_to_place": "अपना प्रतीक रखने के लिए बस खेल बोर्ड पर किसी भी खाली सेल पर क्लिक करें।",
      "get_in_row": "जीतने के लिए अपने प्रतीकों को एक पंक्ति में (क्षैतिज, ऊर्ध्वाधर, या तिरछे) लाएं।",
      "draw_if_full": "यदि सभी सेल बिना विजेता के भर जाती हैं, तो यह ड्रॉ है।"
    },
    "winning_example": {
      "title": "जीतने का उदाहरण",
      "description": "यहां एक स्पष्ट चित्रण है कि कैसे खिलाड़ी 1 ({symbol}) एक मानक 4x4 बोर्ड पर तिरछे कनेक्शन के साथ विजय प्राप्त कर सकता है:",
      "scenario": "इस परिदृश्य में, खिलाड़ी 1 ने एक तिरछे पथ पर चार {symbol} प्रतीकों को सफलतापूर्वक जोड़ा है, जीत सुनिश्चित की।"
    },
    "power_ups": {
      "title": "पावर-अप्स",
      "description": "रणनीतिक लाभ आपका इंतजार कर रहे हैं! प्रत्येक खिलाड़ी के पास तीन अनोखे पावर-अप्स तक पहुंच है जो खेल के प्रवाह को नाटकीय रूप से बदल सकते हैं। पावर-अप्स के उपयोग के बाद एक कूलडाउन अवधि होती है, जिसका मतलब है कि वे कुछ टर्न के बाद ही फिर से उपलब्ध होते हैं। उन्हें सही समय पर उपयोग करना खेल में महारत हासिल करने की कुंजी है!",
      "freeze": {
        "title": "फ्रीज़ पावर-अप",
        "description": "फ्रीज़ पावर-अप आपको बोर्ड पर अपने प्रतिद्वंदी के एक सक्रिय प्रतीक को अक्षम करने की अनुमति देता है। एक बार जब कोई प्रतीक फ्रीज़ हो जाता है, तो यह निष्क्रिय हो जाता है, जिसका मतलब है:",
        "list_item_1": "इसे ओवरराइड नहीं किया जा सकता।",
        "list_item_2": "यह किसी भी जीतने वाले संयोजन में योगदान नहीं देता।",
        "list_item_3": "यह प्रभावी रूप से आपके प्रतिद्वंदी की रणनीति में एक ब्लॉक के रूप में काम करता है।",
        "list_item_4": "इसे अभी भी स्वैप पावर-अप का उपयोग करके एक्सचेंज किया जा सकता है।",
        "defensive_tool": "यह पावर-अप संभावित जीतने वाली लाइनों को बाधित करने के लिए एक रक्षात्मक उपकरण है। यह केवल मौजूदा प्रतिद्वंदी प्रतीकों को लक्षित कर सकता है, आपके अपने या खाली सेल को नहीं। हालांकि, यदि कोई बम पावर-अप फ्रीज़ किए गए सेल को मारता है, तो यह प्रतीक को हटाए बिना बोर्ड से इसे अनफ्रीज़ कर देगा।",
        "example": "इस उदाहरण में, खिलाड़ी 1 ({symbol}) ने खिलाड़ी 2 के ({symbol2}) प्रतीक पर शीर्ष-मध्य सेल में फ्रीज़ पावर-अप का उपयोग किया है। यह {symbol2} अब फ्रीज़ हो गया है, जिससे यह भविष्य के मूव्स में अप्रयोग्य हो जाता है और खिलाड़ी 2 को उस वर्ग के माध्यम से ऊर्ध्वाधर, तिरछे, या क्षैतिज लाइनों को पूरा करने से रोकता है।"
      },
      "bomb": {
        "title": "बम पावर-अप",
        "description": "बम पावर-अप आपको बोर्ड पर किसी भी एकल वर्ग को लक्षित करने की क्षमता देता है। जब सक्रिय होता है, तो चयनित वर्ग और सभी 8 आसपास के आसन्न वर्ग (यदि वे बोर्ड की सीमाओं के भीतर मौजूद हैं) तुरंत किसी भी प्रतीकों से साफ़ हो जाएंगे। यदि कोई लक्षित वर्ग फ्रीज़ हुआ था, तो बम प्रभावी रूप से फ्रीज़ प्रभाव को हटा देगा लेकिन प्रतीक नहीं।",
        "example_before": "खिलाड़ी 1 ({symbol}) बम पावर-अप को तैनात करने वाला है, दूसरी पंक्ति, दूसरे कॉलम में चिह्नित {symbol2} को लक्षित कर रहा है। इसके आसपास के प्रतीकों पर ध्यान दें।",
        "example_after": "{symbol2} और इसके सभी आसन्न प्रतीक सफलतापूर्वक साफ़ हो गए हैं, दोनों खिलाड़ियों के लिए नई रणनीतिक संभावनाएं खोल रहे हैं।"
      },
      "swap": {
        "title": "स्वैप पावर-अप",
        "description": "स्वैप पावर-अप आपको बोर्ड पर किसी भी दो मौजूदा प्रतीकों की स्थितियों को एक्सचेंज करने की अनुमति देता है। यह पावर-अप केवल तब सक्रिय होता है जब दो अधिकृत वर्ग चयनित होते हैं; यदि आप कोई खाली वर्ग चुनते हैं तो इसका उपयोग नहीं किया जा सकता। अपने प्रतिद्वंदी की लगभग-पूर्ण जीतने वाली लाइनों को तुरंत बाधित करने के लिए, या तुरंत अपनी खुद की जीतने वाली संयोजन बनाने के लिए इस पावर-अप का उपयोग करें!",
        "example_before": "खिलाड़ी 2 ({symbol2}) ने रणनीतिक रूप से स्वैप पावर-अप सक्रिय किया है। उन्होंने अपने {symbol2} को निचले-दाएं कोने में चुना है भले ही यह फ्रीज़ है और उसी पंक्ति में एक प्रतिद्वंदी का {symbol} है। ये दोनों प्रतीक स्थानों को बदलने वाले हैं, जिससे खिलाड़ी 2 को प्रतिद्वंदी की सेटअप को तोड़ने और संभवतः अपनी खुद की जीतने वाली लाइन स्थापित करने की अनुमति मिलती है। स्वैप पावर-अप फ्रीज़ किए गए प्रतीकों को भी एक्सचेंज कर सकता है, इसे खेल के रुख को बदलने के लिए एक शक्तिशाली उपकरण बनाता है।",
        "example_after": "{symbol} और {symbol2} ने सफलतापूर्वक स्थान बदल लिए हैं। इस रणनीतिक चाल ने खिलाड़ी 2 ({symbol2}) को तुरंत दूसरे कॉलम के माध्यम से एक ऊर्ध्वाधर जीतने वाली लाइन पूरी करने की अनुमति दी, उनकी जीत सुनिश्चित की। स्वैप पावर-अप का लाभ उठाकर यहां तक कि फ्रीज़ किए गए प्रतीक {symbol2} के साथ एक रक्षात्मक स्थिति को जीतने वाली स्थिति में बदलने में सक्षम रहा।"
      }
    }
  },
  "global": {
    "player": "खिलाड़ी",
    "language": "भाषा",
    "left": "शेष",
    "languages": {
      "arabic": "अरबी",
      "english": "अंग्रेज़ी",
      "french": "फ्रेंच",
      "hindi": "हिंदी",
      "hungarian": "हंगेरियन",
      "japanese": "जापानी",
      "russian": "रूसी"
    }
  },
  "modals": {
    "quit_game_modal": {
      "title": "सक्रिय मैच",
      "message": "आप एक सक्रिय मैच में हैं, क्या आप छोड़ना चाहते हैं?",
      "confirm": "हाँ",
      "cancel": "नहीं"
    },
    "match_aborted_modal": {
      "title": "मैच रद्द कर दिया गया!",
      "description": "आपका प्रतिद्वंदी खेल से बाहर हो गया है। आपको मुख्य मेनू पर वापस भेजा जाएगा।",
      "back_to_menu": "मेनू पर वापस जाएं"
    }
  },
  "aria_labels": {
    "empty_square": "खाली वर्ग, चाल चलने के लिए क्लिक करें",
    "selected_square": "चयनित वर्ग, बदलने के लिए प्रतिद्वंदी वर्ग पर क्लिक करें",
    "frozen_square": "फ्रीज़ किया गया वर्ग, चाल नहीं चल सकते",
    "occupied_square": "{symbol} प्रतीक, भरा हुआ वर्ग"
  }
}