{
  "header": {
    "about": "Справка",
    "menu": "Меню",
    "reset": "Сбросить",
    "rematch": "Переиграть",
    "fullscreen": {
      "enter": "Полноэкранный режим",
      "exit": "Выход из полноэкранного режима"
    },
    "volume": {
      "mute": "Выключить звук",
      "unmute": "Включить звук"
    },
    "install": {
      "button": "Установить",
      "button_app": "Установить приложение",
      "title": "Установить приложение",
      "ios_title": "Нажмите на иконку поделиться и выберите 'Добавить на главный экран'"
    },
    "playModes": {
      "classic": "Классический",
      "autoHide": "Режим автоскрытия"
    },
    "github": "Посетить GitHub репозиторий"
  },
  "main_menu": {
    "game_modes": {
      "computer": "Играть против компьютера",
      "local": "Играть локально",
      "online": "Играть онлайн"
    },
    "difficulty": {
      "easy": "Легко",
      "medium": "Средне",
      "hard": "Сложно"
    },
    "multiplayer": {
      "setup": {
        "title": "Настройка мультиплеера",
        "subtitle": "Настройте параметры игры",
        "online_players": "Игроки онлайн",
        "find_match": "Найти матч"
      },
      "board_size": "Размер доски",
      "loading": {
        "finding_match": "Поиск матча ...",
        "waiting": "Пожалуйста, подождите, пока мы соединиМ вас c другим игроком"
      }
    }
  },
  "winner_popup": {
    "p1_wins": "Игрок 1 победил!",
    "draws": "Ничья!",
    "p2_wins": "Игрок 2 победил!"
  },
  "game_stats": {
    "p1_wins": "Победы Игрока 1",
    "draws": "Ничьи",
    "p2_wins": "Победы Игрока 2"
  },
  "power_ups": {
    "freeze": "Заморозка",
    "bomb": "Бомба",
    "swap": "Обмен"
  },
  "about": {
    "title": "О Крестиках-ноликах",
    "close_aria": "Закрыть всплывающее окно О программе",
    "game_objective": {
      "title": "Цель игры",
      "description": "Крестики-нолики - это классическая стратегическая игра, где два игрока по очереди размещают свои символы на сетке. Первый игрок, который получит три (или больше на больших досках) своих символов в ряд, либо горизонтально, вертикально или диагонально, побеждает!"
    },
    "how_to_play": {
      "title": "Как играть",
      "player1_starts": "Игрок 1 ({symbol}) всегда начинает игру, размещая свой символ первым. Игрок 2 ({symbol2}) следует за ним.",
      "click_to_place": "Просто нажмите на любую пустую ячейку на игровой доске, чтобы разместить свой символ.",
      "get_in_row": "Разместите свои символы в ряд (горизонтально, вертикально или диагонально), чтобы победить.",
      "draw_if_full": "Если все ячейки заполнены без победителя, это ничья."
    },
    "winning_example": {
      "title": "Пример победы",
      "description": "Вот наглядная иллюстрация того, как Игрок 1 ({symbol}) может достичь победы с диагональным соединением на стандартной доске 4x4:",
      "scenario": "В этом сценарии Игрок 1 успешно соединяет четыре символа {symbol} по диагональному пути, обеспечивая победу."
    },
    "power_ups": {
      "title": "Power-Up'ы",
      "description": "Стратегические преимущества ждут вас! У каждого игрока есть доступ к трем уникальным power-up'ам, которые могут кардинально изменить ход игры. У power-up'ов есть период перезарядки после использования, что означает, что они снова становятся доступными только после прохождения определенного количества ходов. Использование их в правильный момент - ключ к мастерству игры!",
      "freeze": {
        "title": "Power-up Заморозка",
        "description": "Power-up Заморозка позволяет вам обездвижить один из активных символов вашего противника на доске. Как только символ заморожен, он становится неактивным, что означает:",
        "list_item_1": "Его нельзя перезаписать.",
        "list_item_2": "Он не вносит вклад в любые выигрышные комбинации.",
        "list_item_3": "Он эффективно действует как блок в стратегии вашего противника.",
        "list_item_4": "Его все еще можно обменять с помощью power-up'а Обмен.",
        "defensive_tool": "Этот power-up является оборонительным инструментом, используемым для нарушения потенциальных выигрышных линий. Он может нацеливаться только на существующие символы противника, а не на ваши собственные или пустые ячейки. Однако, если power-up Бомба попадает в замороженную ячейку, он разморозит ее с доски без удаления символа.",
        "example": "В этом примере Игрок 1 ({symbol}) использовал power-up Заморозка на символе Игрока 2 ({symbol2}) в верхней-средней ячейке. Этот {symbol2} теперь заморожен, делая его непригодным для использования в будущих ходах и блокируя Игрока 2 от завершения вертикальных, диагональных или горизонтальных линий через этот квадрат."
      },
      "bomb": {
        "title": "Power-up Бомба",
        "description": "Power-up Бомба дает вам возможность нацелиться на любой отдельный квадрат на доске. При активации выбранный квадрат и все 8 окружающих смежных квадратов (если они существуют в пределах границ доски) будут мгновенно очищены от любых символов. Если нацеленный квадрат был заморожен, бомба эффективно удалит эффект заморозки, но не символ.",
        "example_before": "Игрок 1 ({symbol}) собирается развернуть power-up Бомба, нацеливаясь на отмеченный {symbol2} во втором ряду, втором столбце. Обратите внимание на символы, окружающие его.",
        "example_after": "{symbol2} и все его смежные символы были успешно очищены, открывая новые стратегические возможности для обоих игроков."
      },
      "swap": {
        "title": "Power-up Обмен",
        "description": "Power-up Обмен позволяет вам обменять позиции любых двух существующих символов на доске. Этот power-up активен только при выборе двух занятых квадратов; он не может быть использован, если вы выбираете пустой квадрат. Используйте этот power-up, чтобы мгновенно нарушить почти завершенные выигрышные линии вашего противника или немедленно сформировать собственную выигрышную комбинацию!",
        "example_before": "Игрок 2 ({symbol2}) стратегически активировал power-up Обмен. Они выбрали свой собственный {symbol2} в правом нижнем углу, хотя он заморожен, и символ противника {symbol} в том же ряду. Эти два символа вот-вот обменяются местами, позволяя Игроку 2 нарушить настройку противника и, возможно, установить собственную выигрышную линию. Power-up Обмен может даже обменивать замороженные символы, делая его мощным инструментом для изменения хода игры.",
        "example_after": "{symbol} и {symbol2} успешно обменялись местами. Этот стратегический ход позволил Игроку 2 ({symbol2}) немедленно завершить вертикальную выигрышную линию через второй столбец, обеспечив их победу. Используя power-up Обмен даже с замороженным символом {symbol2} смог превратить оборонительную позицию в выигрышную."
      }
    }
  },
  "global": {
    "player": "Игрок",
    "language": "Язык",
    "languages": {
      "arabic": "Арабский",
      "english": "Английский",
      "french": "Французский",
      "hindi": "Хинди",
      "hungarian": "Венгерский",
      "japanese": "Японский",
      "russian": "Русский"
    }
  },
  "modals": {
    "quit_game_modal": {
      "title": "Активная игра",
      "message": "Вы в активной игре, хотите выйти?",
      "confirm": "Да",
      "cancel": "Нет"
    }
  },
  "aria_labels": {
    "empty_square": "Пустая клетка, нажмите для хода",
    "selected_square": "Выбранная клетка, нажмите на клетку противника для обмена",
    "frozen_square": "Замороженная клетка, нельзя сделать ход",
    "occupied_square": "Символ {symbol}, занятая клетка"
  }
}